# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv26-Mamba-Only (仅含深层 Mamba，去除 P2 显微镜版 - 用于消融实验)

nc: 80  # 类别数
scales:
  n: [0.33, 0.25, 1024]  # YOLO26n 规模

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 1, C3k2, [128, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 1, C3k2, [256, False, 0.25]] # 4
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 1, C3k2, [512, True]]  # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 1, C3k2, [1024, True]] # 8
  - [-1, 1, SPPF, [1024, 5]]    # 9
  - [-1, 1, C2PSA, [1024]]      # 10
  
  # 👇 保留深层 Mamba 杀招！
  - [-1, 1, MambaHandshake, [256, 256]] # 11: Mamba 深层空间握手

head:
  # ================== 第一阶段：自上而下的特征放大 (Top-down) ==================
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 12
  - [[-1, 5], 1, Concat, [1]]  # 13 (连回 P4 特征)
  - [-1, 1, C3k2, [512, False]] # 14
  
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 15
  - [[-1, 3], 1, Concat, [1]]  # 16 (连回 P3 特征)
  - [-1, 1, C3k2, [256, False]] # 17 (原有的 P3/8-small 特征，这是第一个检测头！)

  # 🔥 (手术点：已切除 P2 显微镜相关的上采样和拼接) 🔥

  # ================== 第二阶段：自底向上的特征融合 (Bottom-up) ==================
  # 把 P3 往下传，去融合 P4
  - [-1, 1, Conv, [256, 3, 2]]  # 18: 下采样 P3
  - [[-1, 14], 1, Concat, [1]]  # 19: 和上面的第 14 层 (P4) 拼接 (注意编号已自动修正)
  - [-1, 1, C3k2, [512, False]] # 20: 生成增强版的 P4 预测特征 (这是第二个检测头！)

  # 把 P4 往下传，去融合 P5 (你的 Mamba 握手层)
  - [-1, 1, Conv, [512, 3, 2]]  # 21: 下采样 P4
  - [[-1, 11], 1, Concat, [1]]  # 22: 绝妙之处：这里精准接回第 11 层的 Mamba 输出！
  - [-1, 1, C3k2, [1024, True]] # 23: 生成增强版的 P5 预测特征 (这是第三个检测头！)

  # ================== 第三阶段：传统三头狙击检测器 ==================
  # 恢复为标准的 [17, 20, 23] 三头输出，完美匹配消融实验逻辑！
  - [[17, 20, 23], 1, Detect, [nc]]  # 24: Detect(P3, P4, P5)