# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv26-Mamba 魔改版架构图 (深层融合完全体)

nc: 80  # 类别数，代码会自动覆盖为你数据集的 2
scales:
  n: [0.33, 0.25, 1024]  # YOLO26n 规模

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2  (👈 纯血显微镜归位！)
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 1, C3k2, [128, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 1, C3k2, [256, False, 0.25]] # 4
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 1, C3k2, [512, True]]  # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 1, C3k2, [1024, True]] # 8
  - [-1, 1, SPPF, [1024, 5]]    # 9
  - [-1, 1, C2PSA, [1024]]      # 10
  
  # 👇 终极杀招：在深层插入 Mamba！直接提取 1024 通道的高级特征
  - [-1, 1, MambaHandshake, [256, 256]] # 11: Mamba 深层空间握手

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 12
  - [[-1, 5], 1, Concat, [1]]  # 13 👈 (重要修改：原为 6，现改为 5，连回 P4 特征)
  - [-1, 1, C3k2, [512, False]]  # 14

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 15
  - [[-1, 3], 1, Concat, [1]]  # 16 👈 (重要修改：原为 4，现改为 3，连回 P3 特征)
  - [-1, 1, C3k2, [256, False]]  # 17 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]  # 18
  - [[-1, 14], 1, Concat, [1]]  # 19 cat head P4 (维持不变)
  - [-1, 1, C3k2, [512, False]]  # 20 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]  # 21
  - [[-1, 11], 1, Concat, [1]]  # 22 👈 (精妙之处：这里直接承接第 11 层的 Mamba 输出，把闪烁热力图送入检测头！)
  - [-1, 1, C3k2, [1024, True]]  # 23 (P5/32-large)

  - [[17, 20, 23], 1, Detect, [nc]]  # 24 Detect(P3, P4, P5) (维持不变)